<a href="https://colab.research.google.com/github/srinijadharani/Python-for-ML-and-DS/blob/master/Day2(Pandas).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **PANDAS**<br>
1. Open source library built on top of NumPy
2. Fast analysis and data cleaning and preparation
3. Excels in performance and productivity
4. Built-in visualisation features

### **SECTION-6**

**SERIES**<br>
This data type is very similar to NumPy arrays and in fact, it is built on top of a NumPy array object. But the main difference is that series can have access labels.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"ten":10,"twenty":20,"thirty":30}

In [4]:
pd.Series(data = my_data) #data is a keyword here. It is an attribute

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

ten       10
twenty    20
thirty    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=labels) #Series can hold any data type.

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series(data = [sum,len,print]) #this holds the references to the built-in functions

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4],["Hello","Hola","Ciao","Bonjour"])

In [13]:
ser1

Hello      1
Hola       2
Ciao       3
Bonjour    4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,3,4],["Hello","Hallo","Ciao","Bonjour"])
ser2

Hello      1
Hallo      2
Ciao       3
Bonjour    4
dtype: int64

In [15]:
ser1 +ser2

Bonjour    8.0
Ciao       6.0
Hallo      NaN
Hello      2.0
Hola       NaN
dtype: float64

Pandas and NumPy while working together, convert integers into floating point values.

## **DATAFRAMES**

**DATAFRAMES-1**

In [16]:
import numpy as np
import pandas as pd

In [17]:
from numpy.random import randn

Seed function is used to save the state of a random function, so that it can generate same random numbers on multiple executions of the code on the same machine or on different machines (for a specific seed value).

In [18]:
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"]) #manually creating a DataFrame

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
type(df["W"])

pandas.core.series.Series

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df["X+Y"] = df["X"] + df["Y"]

In [27]:
df

          W         X         Y         Z       X+Y
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [28]:
df.drop("X+Y", axis=1) #this is not permanent. the X+Y column will still be showing even after dropping it in this cell

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df

          W         X         Y         Z       X+Y
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [30]:
df.drop("X+Y", axis=1, inplace = True) #inplace allows us to permamently delete a column.

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.shape #returns a tuple

(5, 4)

In [33]:
df.loc["A"] #this is the first method of displaying rows. pass in the string or the character by which the row is denoted by.
            #location based index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [34]:
type(df.loc["A"])  #this shows that not only columns are series, but rows are too.

pandas.core.series.Series

In [35]:
df.iloc[2] #pass in the index of the row you want to display. this is the second method of displaying rows. Numerical based index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.loc["D"]["Z"] #always [rows][columns]

0.9550565092637361

In [38]:
df.loc[["A","D"],["W","Y"]] #A and D are the rows and W and Y are the columns

          W         Y
A  2.706850  0.907969
D  0.188695 -0.933237

**Creating another DF and performing various operations.**

In [39]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [40]:
np.random.seed(101)

In [41]:
df = pd.DataFrame(randn(3,2),["BEEE","CE","DS"],["A","B"])

In [42]:
df

             A         B
BEEE  2.706850  0.628133
CE    0.907969  0.503826
DS    0.651118 -0.319318

In [43]:
#display all the values possessed by A (series)
df["A"]

BEEE    2.706850
CE      0.907969
DS      0.651118
Name: A, dtype: float64

In [44]:
#display all the values possessed by B
df["B"]

BEEE    0.628133
CE      0.503826
DS     -0.319318
Name: B, dtype: float64

In [45]:
#display the value possessed by A in BEEE
df.loc["BEEE","A"]

2.706849839399938

In [46]:
#display the values stored in BEEE
df.loc["BEEE"]

A    2.706850
B    0.628133
Name: BEEE, dtype: float64

In [47]:
#display CE and DS values possessed by A and B
df.loc[["CE","DS"],["A","B"]]

           A         B
CE  0.907969  0.503826
DS  0.651118 -0.319318

**DATAFRAMES-2**

In [48]:
import numpy as np
import pandas as pd

In [49]:
np.random.seed(101)
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [51]:
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [52]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
df[booldf] #this will return the actual values where it's true and null (NaN) where it's false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [55]:
df[df["W"] > 0] #this doesn't display the row that shows false in the 'W'th column.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
#display all the rows in df where z < 0
df[df["Z"] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [58]:
resultdf = df[df["W"] > 0]

In [59]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
resultdf["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [61]:
df[df["W"] > 0]["Y"] #same as the above

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [62]:
df[df["W"] > 0][["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [63]:
boolser = df["W"] > 0
result = df[boolser]
columns = ["X","Y"]
result[columns]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
#to display the columns W and Y where Y is positive
df[df["Y"] > 0][["W","Y"]]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813
E  0.190794  2.605967

If you want to check multiple conditions in a DataFrame, don't use the 'and' operator. 'and' operator works only when there are two boolean values. But the output we are generating is series. So, a series has so many True and False values. 'and' doesn't work then. So, instead, we can use the & operator. Similarly instead of 'or' operator, use |.

In [66]:
w_column = df["W"] > 0
y_column = df["Y"] > 1
res = df[(w_column) & (y_column)]
res

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df[(df["W"] > 0) & (df["Y"] > 1)] #same as above

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df[(df["W"] > 0) | (df["Y"] > 1)] #opposite of the above

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df.reset_index() #this resets the index as the normal range (0 to n). 
#this doesn't occur normally unless specified using inplace = True.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [71]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df.set_index("Z") #now Z is the new index

                  W         X         Y
Z
 0.503826  2.706850  0.628133  0.907969
 0.605965  0.651118 -0.319318 -0.848077
-0.589001 -2.018168  0.740122  0.528813
 0.955057  0.188695 -0.758872 -0.933237
 0.683509  0.190794  1.978757  2.605967

In [73]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**MISSING DATA**<br>
When you are dealing with pandas, and if you have any missing values, pandas will automatically fill that missing value place with NaN.

In [74]:
import numpy as np
import pandas as pd

In [75]:
d = {"A":[1,2,np.nan], "B":[5,np.nan,np.nan],"C":[1,2,3]}

In [76]:
df = pd.DataFrame(d)

In [77]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

**If you want to make any change permament, specify inplace=True.**

In [78]:
df.dropna() #this method is going to drop a row or rows that contains one or more null values (NOT permanent)

     A    B  C
0  1.0  5.0  1

In [79]:
#for df.dropna(), axis=0 by default that means the operations occur along the rows. 
#but if you want to perform the operations along the column, set axis=1 (NOT permanent)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
df.dropna(thresh=2) 
#thresh=2 means in that particular row or column, minimum 2 non na values are required.
#if thresh=1, minimum 1 non na value is required.
#this will drop the rows or columns that fail to satisfy the thresh condition (NOT permanent)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [82]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [83]:
df.fillna(value="FILL")
#this method allows to fill the na values with some other value specified in the 'value' attribute. (NOT permanent)

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

**GROUPBY**<br>
groupby allows you to group together rows based off of a column and perform some sort of aggregate operations.

In [86]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"Company":["Google","Google","Microsoft","Microsoft","FaceBook","FaceBook"],
    "Person":["Sam","Charlie","Amy","Venessa","Cari","Sarah"],
    "Sales":[200,120,340,124,243,350]})
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Venessa    124
4   FaceBook     Cari    243
5   FaceBook    Sarah    350

In [87]:
#to groupby the company name and display the average sales per company
bycomp=df.groupby("Company")
bycomp.mean() #this takes only the integer value columns. doesn't consider strings

           Sales
Company
FaceBook   296.5
Google     160.0
Microsoft  232.0

In [88]:
bycomp=df.groupby("Company")
bycomp.sum()

           Sales
Company
FaceBook     593
Google       320
Microsoft    464

In [89]:
bycomp=df.groupby("Company")
bycomp.std() #standard deviation

                Sales
Company
FaceBook    75.660426
Google      56.568542
Microsoft  152.735065

In [90]:
bycomp.sum().loc["Google"]

Sales    320
Name: Google, dtype: int64

In [91]:
bycomp=df.groupby("Company").count()
bycomp

           Person  Sales
Company
FaceBook        2      2
Google          2      2
Microsoft       2      2

In [92]:
bycomp=df.groupby("Company").max()
print(bycomp)
bycomp=df.groupby("Company").min()
print(bycomp)

            Person  Sales
Company
FaceBook     Sarah    350
Google         Sam    200
Microsoft  Venessa    340
            Person  Sales
Company
FaceBook      Cari    243
Google     Charlie    120
Microsoft      Amy    124

In [93]:
bycomp=df.groupby("Company").describe()

In [94]:
bycomp

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FaceBook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
bycomp=df.groupby("Company").describe().transpose()["Google"]

In [96]:
bycomp

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Google, dtype: float64

In [97]:
bycomp=df.groupby("Company").describe()

In [98]:
bycomp

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FaceBook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

**MERGING, JOINING AND CONCATENATING DATAFRAMES**

In [99]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [100]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [101]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [102]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [103]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [104]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Concatenation**<br>
Dimensions should match along the axis you are concatenating on. You can use `pd.concat` and pass in a list of DataFrames to concatenate together. This function is going to join rows together. If you want to concatenate along the columns, specify axis=1.

In [105]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
column=pd.concat([df1,df2,df3], axis=1)
column.fillna(value=0)
#the missing values denote that the dataframe didn't have values for all the indices that you wanted to concatenate on.

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  B5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

**Merging**

In [107]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [108]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [109]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [110]:
pd.merge(left, right, on="key", how="inner") 
#the two dataframes will be merged togther based on the 'key' column

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [111]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [113]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [114]:
pd.merge(left, right, on=["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

**Joining**<br>
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [115]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [116]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [117]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [119]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

**OPERATIONS**

In [120]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
df["col2"].unique()
#for returning the unique values

array([444, 555, 666])

In [123]:
df["col2"].nunique()
#for returning the number of unique values

3

In [124]:
#to return how many times each value has occured in a column
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [125]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [126]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [127]:
df[(df["col1"]>2) & (df["col2"] >600)]

   col1  col2 col3
2     3   666  ghi

In [129]:
df[(df["col1"]>2) & (df["col1"] == 4)]

   col1  col2 col3
3     4   444  xyz

In [146]:
def power(x):
  return x**x
df["col1"].apply(power) 
#you can add in your custom functions using the apply() method

0      1
1      4
2     27
3    256
Name: col1, dtype: int64

In [147]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [148]:
df["col1"].apply(lambda x : x**x)

0      1
1      4
2     27
3    256
Name: col1, dtype: int64

In [149]:
df.drop("col1", axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [150]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [152]:
df.columns #columns is an attribute

Index(['col1', 'col2', 'col3'], dtype='object')

In [153]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [154]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [156]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [157]:
df.isnull()
#checks if the value in the given dataframe is null or not and returns a boolean value

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [159]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [160]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [161]:
df.sort_values("D")

     A    B  C  D
0  foo  one  x  1
5  bar  one  y  1
2  foo  two  x  2
1  foo  one  y  3
4  bar  one  x  4
3  bar  two  y  5

In [162]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [163]:
df.pivot_table(values="D", index=["A","B"], columns="C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN